tests/fixtures/Common/List/subscriptions.json

{
    "object": "list",
    "count": 1,
    "url": "/v1/customers/cus_3cbU7OeaCpcS9D/subscriptions",
    "data": [
      {
        "id": "sub_3ceX8jHwVquCNo",
        "plan": {
          "interval": "month",
          "name": "Personal",
          "created": 1370600314,
          "amount": 900,
          "currency": "gbp",
          "id": "personal-9",
          "object": "plan",
          "livemode": false,
          "interval_count": 1,
          "trial_period_days": 30,
          "metadata": {}
        },
        "object": "subscription",
        "start": 1394203572,
        "status": "trialing",
        "customer": "cus_3cbU7OeaCpcS9D",
        "cancel_at_period_end": false,
        "current_period_start": 1394203572,
        "current_period_end": 1396795572,
        "ended_at": null,
        "trial_start": 1394203572,
        "trial_end": 1396795572,
        "canceled_at": null,
        "quantity": 1,
        "application_fee_percent": null,
        "discount": null
      }
    ]
  }